Revit 2024 API
FabricReinSpanSymbol.Create Method
 Places a new instance of the Structural Fabric Reinforcement Symbol into the project relative to a particular FabricSheet and View.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static FabricReinSpanSymbol Create(
	Document document,
	ElementId viewId,
	LinkElementId hostId,
	XYZ point,
	ElementId symbolId
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	viewId As ElementId, _
	hostId As LinkElementId, _
	point As XYZ, _
	symbolId As ElementId _
) As FabricReinSpanSymbol
Visual C++
public:
static FabricReinSpanSymbol^ Create(
	Document^ document,
	ElementId^ viewId,
	LinkElementId^ hostId,
	XYZ^ point,
	ElementId^ symbolId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
viewId
Type: Autodesk.Revit.DB.ElementId
 The id of the view in which the symbol should appear.
hostId
Type: Autodesk.Revit.DB.LinkElementId
 The ElementId of FabricSheet (either in the document, or linked from another document).
point
Type: Autodesk.Revit.DB.XYZ
 The span symbol's head position.
symbolId
Type: Autodesk.Revit.DB.ElementId
 The id of the family symbol of this symbol.
Return Value
 A reference to the newly-created symbol.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  hostId should refer to a FabricSheet element. -or- viewId does not refer to a valid view type for FabricReinSpanSymbol - only floor plan, reflected ceiling plans and elevations are permitted. -or- symbolId should refer to a FamilySymbol of category OST_FabricReinSpanSymbol.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FabricReinSpanSymbol Class
Autodesk.Revit.DB.Structure Namespace